Repository: pancakevirus/nim-lang-081-docs-archived
Catalog: docs/OmegaT/OmegaT-level2.tmx
Source language: en_us
Languages: ja

source: If async is true, this function will return immediately and it will be your job to use asyncdispatch's poll to progress this operation.
ja: async が true ならば、この関数を即座に返します。また、この処理を進行させるために asyncdispatch の poll を使うのはプログラマの仕事です。

source: If dest already exists, it will be overwritten.
ja: 既に dest 存在しているときは、ファイルを上書きします。

source: If dir is "", uses the current working directory.
ja: dir が "" のときは、現在の作業ディレクトリを使います。

source: If key is not in t, the KeyError exception is raised.
ja: t に key がないときは、 KeyError 例外が発生します。

source: If longestMatch is true, the longest match is returned, it doesn't have to be a complete match then.
ja: longestMatch が true ならば、最長一致を返します。この場合は完全一致でなくても問題ありません。

source: If rawStringLiterals is true, string literals are kept with their surrounding quotes and escape sequences in them are left untouched too.
ja: rawStringLiterals が true のときは、文字列リテラルの前後にあるクォートは取り除かれず、エスケープ・シーケンスはそのままになります。

source: If recursive is true, the topmost subdirectory of dir will be created first, following the secondmost... etc. this allows you to give a full path as the dir without worrying about subdirectories not existing.
ja: recursive が true ならば、最初に dir の第一階層サブディレクトリを、続いて第二階層サブディレクトリ……などを作成します。 これによりサブディレクトリの有無を気しなくても dir をフルパスで指定できます。

source: If n is a JObject, it returns the number of pairs.
ja: n が JObject ならば、ペア数を返します。

source: If s is no HTML tag, tagUnknown is returned.
ja: s が HTML タグでなければ、 tagUnknown が返されます。

source: If workingDir == "" the current directory is used (default).
ja: もし workingDir == "" ならば現在のディレクトリを使います (デフォルト)。

source: If a $ operator for a concrete enumeration is provided, this is used instead.
ja: 具象化抽象型で $ 演算子が使えるときは、これを代わりに使います

source: If an identifier is a Nim keyword the `identifier` notation is used.
ja: 識別子が Nim キーワードのときは `identifier` 記法を使います。

source: If any documentation build sub commands fail, they will be rerun in serial fashion so that meaninful error output can be gathered for inspection.
ja: ドキュメンテーションのビルドにおいてサブコマンドが失敗したならば、エラーの詳細を出力後に直列ビルドを再実行します。

source: If assertions are turned off, it does nothing.
ja: アサーション無効時、なにも処理をしません。

source: If assertions are turned on, later versions will check the string for valid syntax.
ja: アサーション有効時、将来のバージョンではシンタックスが正しいか文字列を検査します。

source: If expression
ja: If 式

source: If in doubt copy the string before passing it.
ja: 疑わしいときは、文字列を渡す前にコピーしてください。

source: If it fails, it returns (false, default(msg)) otherwise it returns (true, msg).
ja: 失敗時は (false, default(msg)) を、それ以外は (true, msg) を返します。

source: If it is a directory name, all files in the directory are used:
ja: ディレクトリ名ならば、ディレクトリ内にあるファイルを全て使います:

source: If nimcache already contains compiled code from a different compiler for the same project, add the -f flag to force all files to be recompiled.
ja: 同じプロジェクトで異種コンパイラを用いてコンパイルされたコードが nimcache によりキャッシュ済みならば、 -f フラグを指定してファイルをすべて強制再コンパイルしてください。

source: If no cookie of name exists, "" is returned.
ja: 指定されたクッキー name がないときは、 "" を返します。

source: If no valid color could be parsed ValueError is raised.
ja: 有効なカラー名を解釈できないときは ValueError が発生します。

source: If not specified, this is the same as Name.
ja: 未指定時は、 Name と同じになります。

source: If statement
ja: If ステートメント

source: If the replacement is not an absolute path, the path is interpreted to be local to the Nimscript file that contains the call to patchFile, Nim's --path is not used at all to resolve the filename!
ja: replacement が絶対パスでなければ、パスは patchFile を呼び出すローカルな Nimscript ファイルとして解釈されるため、 Nim の --path はファイル名の解決に使われません！

source: If the key does not exist, nothing happens.
ja: key がなければ、何もしません。

source: If the client does not use a method listed in the allowedMethods set, an ECgi exception is raised.
ja: クライアントで allowedMethods 集合にあるメソッドのリストを使っていないときは、 ECgi 例外が発生します。

source: If the directory already exists, no error is raised.
ja: 既にディレクトリが存在していても、エラーは発生しません。

source: If the external process terminates with a non-zero exit code, an OSError exception is raised.
ja: 非ゼロで外部プロセスが停止したときは、 OSError 例外が発生します。

source: If the file cannot be opened, nil is returned.
ja: ファイルが開けないときは、 nil を返します。

source: If the file does not exist IOError is raised.
ja: ファイルがないときは IOError が発生します。

source: If the file pointer is past the end of the file then an empty string is returned.
ja: ファイルポインタがファイル終端を超えたならば空文字列を返します。

source: If the file pointer is past the end of the file then zero is returned and no bytes are read into buf
ja: ファイルポインタがファイル終端を超えたならば 0 を返し、バイトを buf へ読み込みません。

source: If the future stream already has data or is finished then cb will be called immediately.
ja: Future ストリームに既存データがある、または完了しているときは即座に cb (コールバック) を呼び出します。

source: If the key does exist, c.excl(key) is performed.
ja: key があれば c.excl(key) を実行します。

source: If the key does not exist c[key] = val is performed.
ja: key がなければ c[key] = val を実行します。

source: If the key does not exist it is inserted into c.
ja: key がなければ c へ挿入します。

source: If the library fails to load or the function 'greet' is not found, it quits with a failure error code.
ja: ライブラリのロードに失敗、または 'greet' 関数がみつからないときは失敗のエラーコードを返して終了します。

source: If the query doesn't return any rows, this proc will return a Row with empty strings for each column.
ja: クエリで行が返されないときは、このプロシージャは各列を空文字にした Row を返します。

source: If this fails, OSError is raised.
ja: 失敗時は IOError が発生します。

source: If this fails, returns false.
ja: 失敗時は false を返します。

source: If true, the UI's code-page is returned, if false, the Console's code-page is returned.
ja: true ならば UI のコードページを、 false ならばコンソールのコードページが返されます。

source: If you don't know what this means, you shouldn't use this proc.
ja: この意味を知らないなら、このプロシージャは使わないでください。

source: If you need a permanent change, use the cd() proc.
ja: 恒常的に変更したいときは、 cd() プロシージャをお使いください。

source: If you need to call this inside a compile time macro you can use staticRead.
ja: これをコンパイル時マクロ内で呼び出す必要があるときは staticRead を使います。

source: If you need to use this module with older versions of JavaScript, you can use a tool that backports the resulting JavaScript code, as babel.
ja: このモジュールを JavaScript の旧バージョンで使いたいときは、 babel などの JavaScript コードを生成するバックポート用ツールが使えます。

source: If you pass nil as the array both attributes will be set to the current time.
ja: nil 配列を渡すと両方のプロパティに現在時刻を設定します。

source: If you use toMD5 proc there's no need to call this function explicitly.
ja: この関数は toMD5 プロシージャ を使うときは明示的に呼び出す必要はありません。

source: If you want exceptions and a proper Nim-like interface, use the OS module or write a wrapper.
ja: 例外処理と Nim ライクな本来のインタフェースを求めるならば OS モジュールの使用、またはラッパーを開発してください。

source: If you want to enable SSL, compile with -d:ssl.
ja: SSLを有効にするには -d:ssl でコンパイルしてください。

source: If you want to statically link against OpenSSL 1.0.x, you now have to define the openssl10 symbol via -d:openssl10.
ja: OpenSSL 1.0.x を静的リンクする場合は、 -d:openssl10 で openssl10 シンボルを定義してください。

source: Implements IETF RFC-6694 Section 3, "about:blank" must be reserved for a blank page.
ja: IETF RFC-6694 Section 3 の実装であり、 "about:blank" は空ページ用に予約されています。

source: Implements a representation of Unicode with the limited ASCII character subset.
ja: ASCII 文字の部分集合に限定した Unicode 形式の実装です。

source: Import section
ja: Import セクション

source: Import statement
ja: Import ステートメント

source: ImportCpp pragma
ja: ImportCpp プラグマ

source: ImportJs pragma
ja: ImportJs プラグマ

source: ImportObjC pragma
ja: ImportObjC プラグマ

source: Importc pragma
ja: Importc プラグマ

source: Imports
ja: インポート

source: Impure libraries
ja: 混血ライブラリ

source: In addition to the previous levels dumps a debug stack trace for compiler developers.
ja: 前述のレベルに加えて、コンパイル開発者向けのデバッグ用スタックトレースをダンプします。

source: In fact, the root-mean-square error growth, assuming random roundoff errors, is only O(sqrt(log n)), which is nearly indistinguishable from O(1) in practice.
ja: 実際、偶発的な端数切り捨て誤差を想定しているため、 O(sqrt(log n)) となるだけです。実用上は O(1) との区別はほぼできません。

source: In general the stack traces show you immediately where the problem is because the trace acts like an explanation; in traditional profilers you can only find expensive leaf functions easily but the reason why they are invoked often remains mysterious.
ja: 一般にスタックトーレスはトレース結果が説明として機能するため即座に問題が明らかとなります。伝統的なプロファイラでは高負荷のリーフ関数を発見しやすくする機能しかなく 頻繁に呼び出される理由までは説明できません。

source: In order to begin any sort of transfer of files you must first connect to an FTP server.
ja: ファイルを転送するには FTP サーバーへ接続します。

source: In order to compile Nim correctly, type-checking has to be separated from parsing.
ja: Nim で正確にコンパイルするために、構文解析から型検査を切り離しています。

source: In other words sets a thread's affinity.
ja: 言い替えればスレッドの有縁性 (thread affinity) を設定します。

source: In some file system types, this
ja: 一部のファイルシステムの種類では、

source: In this case Coroutine.reference.coro is set to nil.
ja: この場合、 Coroutine.reference.coro には nil を設定します。

source: In this case we look for hyperlinks ending with the extension .rst and convert them to .html.
ja: この用例では、拡張子 .rst で終わるファイルからハイパーリンクを探して .html へ変換します。

source: In this situation you have to concatenate manually the contents of args to command carefully escaping/quoting any special characters, since it will be passed as is to the system shell.
ja: この状況ではシステムのシェルへ args がそのまま渡されるため、特殊文字のエスケープやクォート処理と command へ args の内容を慎重に手動連結してください。

source: Include statement
ja: Include ステートメント

source: IncompleteStruct pragma
ja: IncompleteStruct プラグマ

source: Indent with two spaces.
ja: インデントはスペース２文字で書いてください。

source: Indentation
ja: インデント

source: Index (idx) file format
ja: インデックスファイル形式 (idx)

source: Index switch
ja: Index スイッチ

source: Inherit your lexer from this object.
ja: このオブジェクトから lexer を継承してください。

source: Inheritance
ja: 継承

source: Initialize SSL using OPENSSL_init_ssl for OpenSSL >= 1.1.0 otherwise SSL_library_init Source Edit
ja: OpenSSL 1.1.0 以降は OPENSSL_init_ssl を、それ以外は SSL_library_init で SSL を初期化します ソース 編集

source: Initializes a MD5Context.
ja: MD5Context を初期化します。

source: Initializes the given condition variable.
ja: 指定された状態変数を初期化します。

source: Initializes the given lock.
ja: 指定されたロックを初期化します。

source: InjectStmt pragma
ja: InjectStmt プラグマ

source: InnoSetup section
ja: InnoSetup セクション

source: Insert the child son to a given position in father.
ja: father の指定位置へ子の son を挿入します。

source: Inserting data
ja: データの挿入

source: Installation
ja: インストール

source: Instead the API here needs to be used.
ja: この API を代わりにお使いください。

source: Instead, a seq[string] is returned for each row.
ja: 代わりに、各行で seq[string] が返されます。

source: Integer literals:
ja: 整数リテラル:

source: Integers
ja: 整数

source: Internal error in the module, this probably means that there is a bug Source Edit
ja: Internal error in the module, this probably means that there is a bug ソース 編集

source: Internal type representation
ja: 型の内部表現

source: Internally calls terminalWidth and terminalHeight, so the same assumptions apply.
ja: 内部処理で terminalWidth と terminalHeight を呼び出すため、同一前提条件を適用します。

source: Internals of the Nim Compiler
ja: Nim コンパイラの内部構造

source: Internet Protocols and Support
ja: インターネットプロトコルとサポート

source: Introduction
ja: はじめに

source: Invalid SQL encountered Source Edit
ja: 無効な SQL との遭遇 ソース 編集

source: Is operator
ja: Is 演算子

source: It accepts any expression and prints a textual representation of the tree representing the expression - as it would appear in source code - together with the value of the expression.
ja: 式の入力後、ソースコードに出現する式の値と併せて式のツリー構造をテキスト形式で出力します。

source: It accepts the same options as you would pass to the boot command.
ja: boot コマンドと同じオプションを指定できます。

source: It allows you to connect to an FTP server and perform operations on it such as for example:
ja: 例えば、このような処理を FTP サーバーに接続して行えます。

source: It also provides IO facilities for reading and writing text and binary files.
ja: また、テキストとバイナリファイルの読み書きに関する IO 機能も実装してあります。

source: It also repeats the same operation but places the result in the web/upload which can be used to update the website at https://nim-lang.org.
ja: また、この変換処理はウェブサイト https://nim-lang.org/ の更新で使うドキュメンテーション一式を web/upload へ出力します。

source: It assumed that s is in srcEncoding.
ja: s は srcEncoding であると想定しています。

source: It can be used to implement a dynamically resizable buffer that is guaranteed to remain in the same memory location.
ja: 同一メモリ記憶位置に残存することを保証した動的サイズ変更可能バッファの実装に使えます。

source: It can be used to parse a wild HTML document and output it as valid XHTML document (well, if you are lucky):
ja: 野良 HTML ドキュメントの構文解析を行い、有効な XHTML ドキュメントへの変換・出力にも使えます (運がよければ):

source: It can search for regex or peg patterns and can search whole directories at once.
ja: 正規表現、または PEG パターンでの検索とディレクトリ全体の一括検索ができます。

source: It does not not provide any convenience: cstrings are used instead of proper Nim strings and return codes indicate errors.
ja: そのため、利便性はありません: Nim 文字列ではなく適切な cstrings を使い、返値 (return code) はエラーを表します。

source: It does not run immediately.
ja: つまり、すぐには実行しません。

source: It does so by patching every call in calls to use arg as the first argument.
ja: この処理では、第一引数として arg を使うために calls の呼び出しごとにパッチを当てます。

source: It follows a description of each possible section and how it affects the generated installers.
ja: 下記は利用できる各セクションと生成されるインストーラの影響について説明しています。

source: It is a replacement for make and shell scripting with the advantage that it is much more portable.
ja: make コマンドやシェルスクリプトよりも高い汎用性がある優れたツールです。

source: It is advisable to register this as a quit proc with system.addQuitProc(resetAttributes).
ja: これを system.addQuitProc(resetAttributes) により quit プロシージャとして登録することは懸命なことです。

source: It is an error if the current file position is not at the beginning of the file.
ja: 現在のファイル位置がファイルの先頭でなければエラーになります。

source: It is essential to understand most of the compiler's code.
ja: コンパイラのコードの大部分を理解することは必要不可欠です。

source: It is implemented just calling cpuinfo.countProcessors.
ja: この実装は cpuinfo.countProcessors を呼び出します。

source: It is imported implicitly by the compiler.
ja: コンパイラにより暗黙的にインポートされます。

source: It is just optimized to not allocate temporary strings.
ja: つまり、一時作業用の文字列を割り当てずに最適化を行います。

source: It is not a definition of the Nim programming language (which is covered in the manual).
ja: つまり、プログラミング言語 Nim の説明 (definition) ではありません (マニュアルで扱います)。

source: It is used and exported by the json standard library module, but can also be used in its own right.
ja: json 標準ライブラリでの使用とエクスポートを行いますが、単独でも使えます。

source: It is usually not required to do that, nims' filename is the default.
ja: デフォルトは nims のファイル名であるため、通常は設定不要です。

source: It is your job to ensure the package name Source Edit
ja: パッケージ名の遵守は開発者の義務です。 ソース 編集

source: It may also help to find memory leaks.
ja: これはメモリ・リークの発見に役立つことがあります。

source: It may be necessary that the new platform needs to replace this generic code by some assembler code.
ja: 新しいプラットフォームでは、この汎用コードをアセンブラのコードで書き換えることが必要になるかもしれません。

source: It must contain the following key-value pairs:
ja: このセクションにはキー・値から成るペア値が必要です。

source: It parses PostgreSQL syntax and the SQL ANSI standard.
ja: PostgreSQL のシンタックスと SQL ANSI 標準規格を解析します。

source: It provides a single proc that does Unicode to ASCII transliterations: It finds the sequence of ASCII characters that is the closest approximation to the Unicode string.
ja: これは Unicode から ASCII へ翻字を行うプロシージャです。つまり Unicode 文字列に最も近い近似 ASCII 文字のシーケンスを検索します。

source: It provides tools for interaction with JavaScript async API-s and libraries, writing async procedures in Nim and converting callback-based code to promises.
ja: Nim で記述した async プロシージャとコールバックベースのコードを promise への変換により、 JavaScript async API とライブラリとの相互作用するツールを使えるようにします。

source: It relies on compiler magic to work.
ja: この処理はコンパイラ・マジックに依存します。

source: It should always have a Future[T] return type or not have a return type at all.
ja: 必ず返値型は Future[T] であるか、あるいは返値型が全く無いかのどちらかです。

source: It's much better to use tryRecv proc instead.
ja: よって tryRecv proc プロシージャの使用をお勧めします。

source: Items can be modified.
ja: アイテムは修正可能です。

source: Iterate over any line in the file f.
ja: ファイル f にあるすべての行をイテレートします。

source: Iterates over all direct children of n so that they can be modified.
ja: 変更可能にするために n にあるすべての子孫にイテレートを直接行います。

source: Iterates over all direct children of n.
ja: n にあるすべての子孫にイテレートを直接行います。

source: Iterates over all the children of n returning those matching tag.
ja: n にあるすべての子孫にイテレートを行い条件に一致する tag を返します。

source: Iterates over any line in the file named filename.
ja: ファイル名 filename にあるすべての行をイテレートします。

source: Iterates over each element of a.
ja: a の各要素をイテレートします。

source: Iterates over each item of a so that you can modify the yielded value.
ja: 生成値を変更可能にするために a の各アイテムをイテレートします。

source: Iterates over each item of a.
ja: a の各アイテムをイテレートします。

source: Iterates over every field of x and y.
ja: x と y のフィールドをすべてイテレートします。

source: Iterates over every field of x returning their name and value.
ja: x のフィールドをすべてイテレートして名前 (name) と値 (value) を返します。

source: Iterates over every field of x.
ja: x のフィールドをすべてイテレートします。

source: Iterates over the slice s, yielding each value between s.a and s.b (inclusively).
ja: スライス s のイテレートを行い、 s.a と s.b にある各値を生成します (包括的)。

source: Iterates over the values of the enum E.
ja: 列挙型 E の値をイテレートします。

source: Iterator declaration
ja: イテレータ宣言

source: Iterator for the items of node.
ja: node のアイテムで使えるイテレータです。

source: Iterators
ja: イテレータ

source: Iterators and the for statement
ja: イテレータと for ステートメント

source: Its API is still experimental and so is subject to change.
ja: この API は未だ実験段階であり将来変更される場合があります。

source: Its path is obtained via currentSourcePath (although, currently, currentSourcePath resolves symlinks, unlike thisDir).
ja: このパスは currentSourcePath で取得できます (とはいえ、今のところ、 thisDir と異なり、 currentSourcePath はシンボリックリンクを解決します)。

source: Its primary purpose is to produce output for Nimble packages like:
ja: 主な用途は Nimble パッケージ出力などを生成することです。

source: JSON node Source Edit
ja: JSON node ソース 編集

source: JavaScript compatibility
ja: JavaScript との互換性

source: JavaScript target
ja: JavaScript のターゲット

source: JavaScript's delete operator Source Edit
ja: JavaScript's delete operator ソース 編集

source: JavaScript's require function Source Edit
ja: JavaScript's require function ソース 編集

source: JavaScript's __dirname pseudo-variable Source Edit
ja: JavaScript's __dirname pseudo-variable ソース 編集

source: JavaScript's __filename pseudo-variable Source Edit
ja: JavaScript's __filename pseudo-variable ソース 編集

source: JavaScript's arguments pseudo-variable Source Edit
ja: JavaScript's arguments pseudo-variable ソース 編集

source: JavaScript's null literal Source Edit
ja: JavaScript's null literal ソース 編集

source: JavaScript's undefined literal Source Edit
ja: JavaScript's undefined literal ソース 編集

source: Kahan (compensated) summation: O(1) error growth, at the expense of a considerable increase in computational expense.
ja: カハン法による総和 (補正加算): 誤差成長 O(1) は、代償として計算量の相当な増加があります。

source: Kill the process p.
ja: プロセス p を強制終了します。

source: Large dataset queries will impact on memory usage.
ja: 大規模データセットによるクエリはメモリの使用状況に強い影響を及ぼします。

source: Large example
ja: 本格的な用例

source: Larger example
ja: 本格的な用例

source: Later versions will support Linux' package management systems.
ja: 将来のバージョンでは Linux パッケージ管理システムのサポートを予定しています。

source: Let section
ja: Let セクション

source: Let statement
ja: Let ステートメント

source: Level
ja: レベル

source: Lexical Analysis
ja: 字句解析

source: Lexical elements
ja: 字句要素

source: Lib section
ja: Lib セクション

source: Line exceeds the maximum length.
ja: 行の最大長を超過した。

source: LineDir option
ja: LineDir オプション

source: LineTrace option
ja: LineTrace オプション

source: Link pragma
ja: Link プラグマ

source: Linking phase.
ja: リンク処理段階。

source: List of hints
ja: ヒントのリスト

source: List of warnings
ja: 警告のリスト

source: Listed filenames can be separated by semicolon or the files key can be repeated.
ja: セミコロンまたは files キーの繰り返しによりファイル名をリスト化できます。

source: Listed files will be installed into the OS's configuration directory.
ja: リストにあるファイルはオペレーティング・システムのコンフィギュレーションディレクトリへインストールします。

source: Listed files will be installed into the OS's native bin directory (e.g. /usr/local/bin).
ja: リストにあるファイルはオペレーティング・システムにおけるネイティブの bin ディレクトリ (例えば /usr/local/bin) へインストールします。

source: Listed files will be installed into the OS's native documentation directory (which might be $appdir/doc).
ja: リストにあるファイルはオペレーティング・システムにおけるネイティブのドキュメンテーションディレクトリ ($appdir/doc を想定) へインストールします。

source: Listed files will be installed into the OS's native library directory (which might be $appdir/lib).
ja: リストにあるファイルはオペレーティング・システムにおけるネイティブのライブラリディレクトリ ($appdir/lib を想定) へインストールします。

source: Listed files will be installed into the application installation directory ($appdir).
ja: リストにあるファイルはアプリケーションのインストールディレクトリ ($appdir) へインストールします。

source: Lists
ja: リスト

source: Lists all files in dir.
ja: dir にあるファイルをすべてリスト化します。

source: Lists all the files (non-recursively) in the directory dir.
ja: ディレクトリ dir にあるファイルをすべてリスト化します (再起処理ではありません)。

source: Lists all the subdirectories (non-recursively) in the directory dir.
ja: ディレクトリ dir にあるサブディレクトリをすべてリスト化します (再起処理ではありません)。

source: Loading a simple C function
ja: C 関数のロード

source: Loads data from the stream s.
ja: ストリーム s から data をロードします。

source: Loads and parses HTML from file specified by path, and returns a XmlNode.
ja: 指定されたファイルの path から HTML のロードと構文解析を行い、 XmlNode を返します。

source: Loads and parses XML from file specified by path, and returns a XmlNode.
ja: 指定されたファイルの path から XML のロードと構文解析を行い、 XmlNode を返します。

source: Locks all memory for the running process to prevent swapping.
ja: 実行プロセスのメモリをすべてロックすることでスワップの発生を禁止します。

source: Locks pages starting from a1 for a1 bytes and prevent them from being swapped.
ja: a1 バイトの a1 からページをロックすることでスワップの発生を禁止します。

source: Loopback address.
ja: ループバックアドレス。

source: Low level proc.
ja: 低水準プロシージャ。

source: MD5 checksum of a string, obtained with toMD5 proc.
ja: toMD5 プロシージャ で得られる文字列の MD5 チェックサムです。

source: MUST BE CALLED before any compilation Source Edit
ja: 必ずコンパイル前に呼び出してください ソース 編集

source: Macro declaration
ja: マクロ宣言

source: Macro which converts normal procedures into javascript-compatible async procedures Source Edit
ja: 通常のプロシージャを JavaScript 互換 async プロシージャへ変換するマクロです ソース 編集

source: Macros
ja: マクロ

source: Macros are very powerful.
ja: マクロは計り知れないほど強力なものです。

source: Made with Nim.
ja: Nim で作成しました。

source: Make sure to check you are in the correct working directory before you do so with the pwd procedure, you can also instead specify an absolute path.
ja: pwd プロシージャを使う前に作業ディレクトリが正しいか確認してください。また、絶対パスを指定することもできます。

source: Make sure to pass options explicitly.
ja: オプションが明示的に渡されているか確認してください。

source: Makes Nim output stacktraces to stdout, instead of server log.
ja: Nim のスタックトレースをサーバログではなく stdout へ出力します。

source: Manual
ja: マニュアル

source: Many sections support the files key.
ja: 各種セクションでは files キーをサポートしています。

source: Maps a memaligned block of memory from src_addr to dst_addr.
ja: src_addr から dst_addr までを整列済みメモリブロックとしてマップします。

source: Math libraries
ja: 算術ライブラリ

source: MathML https://wikipedia.org/wiki/MathML https://developer.mozilla.org/en-US/docs/Web/MathML/Element/maction Source Edit
ja: MathML https://wikipedia.org/wiki/MathML https://developer.mozilla.org/en-US/docs/Web/MathML/Element/maction ソース 編集

source: MathML https://wikipedia.org/wiki/MathML https://developer.mozilla.org/en-US/docs/Web/MathML/Element/math#Examples Source Edit
ja: MathML https://wikipedia.org/wiki/MathML https://developer.mozilla.org/en-US/docs/Web/MathML/Element/math#Examples ソース 編集

source: MathML https://wikipedia.org/wiki/MathML https://developer.mozilla.org/en-US/docs/Web/MathML/Element/menclose Source Edit
ja: MathML https://wikipedia.org/wiki/MathML https://developer.mozilla.org/en-US/docs/Web/MathML/Element/menclose ソース 編集

source: MathML https://wikipedia.org/wiki/MathML https://developer.mozilla.org/en-US/docs/Web/MathML/Element/merror Source Edit
ja: MathML https://wikipedia.org/wiki/MathML https://developer.mozilla.org/en-US/docs/Web/MathML/Element/merror ソース 編集
